spec/fixtures/services/report_definition/mutate_add-req.xml

<?xml version="1.0" encoding="utf-8" ?>
<env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
  <env:Header>
        <n1:RequestHeader env:mustUnderstand="0"
            xmlns:n1="https://adwords.google.com/api/adwords/cm/v201003">
          <n1:authToken></n1:authToken>
          <n1:userAgent></n1:userAgent>
          <n1:developerToken></n1:developerToken>
          <n1:clientEmail></n1:clientEmail>
        </n1:RequestHeader>
  </env:Header>
  <env:Body>
    <n2:mutate xmlns:n2="https://adwords.google.com/api/adwords/cm/v201003">
      <n2:operations xsi:type="n2:ReportDefinitionOperation">
        <n2:operator>ADD</n2:operator>
        <n2:operand>
          <n2:reportName>report</n2:reportName>
        </n2:operand>
      </n2:operations>
    </n2:mutate>
  </env:Body>
</env:Envelope>
